teapotlaboratories/pico-e32/boards/makerfabs-ili9488/sdkconfig.defaults
# Board: Makerfabs "ESP32-S3 Parallel TFT with Touch (ILI9488)", 3.5", 320x480.
# Module ESP32-S3-WROOM-1-N16R2 = 16 MB flash + 2 MB QUAD PSRAM, 240 MHz.
# The board owns CONFIG_IDF_TARGET; apps layer their own config on top.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
